azogue/hass_config/esp8266_sensors/mqtt_pir_vibro_light_dht22_publisher.c
//Light digital I2c sensor - BH1750
#ifdef WITH_BH1750
  std::list<double> bh1750_lightSamples;   //Collected results per interval
  std::list<double> bh1750_lightHistory;   //History over time.
  BH1750 bh1750_light_sensor(BH1750_ADDR);
#endif


// ###################################################
// DALLAS DS18b20 SENSORS
// ###################################################
/*
DeviceAddress Probe01 = { 0x28, 0x88, 0x45, 0x01, 0x00, 0x00, 0x80, 0x6D };
DeviceAddress Probe02 = { 0x28, 0x16, 0x42, 0x01, 0x00, 0x00, 0x80, 0x9E };
DeviceAddress Probe03 = { 0x28, 0x5E, 0x59, 0x01, 0x00, 0x00, 0x80, 0x46 };
*/

#ifdef ONE_WIRE_BUS                         // DS18b20 temperature sensors
  OneWire oneWire(ONE_WIRE_BUS);
  DallasTemperature DS18B20(&oneWire);

  #ifdef ESP_GALERIA
    #define NUM_SENSORS_DS18B20 3
    uint8_t ds18b20Probes[8 * NUM_SENSORS_DS18B20] = {
      0x28, 0x5E, 0x59, 0x01, 0x00, 0x00, 0x80, 0x46,
      0x28, 0x88, 0x45, 0x01, 0x00, 0x00, 0x80, 0x6D,
      0x28, 0x16, 0x42, 0x01, 0x00, 0x00, 0x80, 0x9E,
    };
  #endif
  std::list<double> ds18b20_tempSamples_arr[NUM_SENSORS_DS18B20];   //Collected results per interval
  std::list<double> ds18b20_tempHistory_arr[NUM_SENSORS_DS18B20];   //History over time
#endif

// Contadores de tiempo
elapsedMillis sinceStart;
int last_sensor_error;
int last_sensor_ok;
int last_dht_sensed;         //The last time a sample was taken from the DHT22 sensor.
int last_bme_sensed;         //The last time a sample was taken from the BME280 sensor.
int last_bh1750_sensed;         //The last time a sample was taken from the BH1750 sensor.
int last_htu21_sensed;         //The last time a sample was taken from the HTU21 sensor.
int last_ds18b20_sensed;     //The last time a sample was taken from the DS18b20 sensors.
int error_counter_dht;

// Last OK message for each sensor/topic:
int last_temp_post;
int last_temp_ds_post;
int last_humid_post;
int last_pressure_post;
int last_light_analog_post;

int last_switch_bin_state_post;
int last_switch_leds_state_post;

// Estados (para el output LED RGB)
#define STATE_ERROR            1
#define STATE_WARN             2
#define STATE_BIN_PUBLISH      3
#define STATE_OK_MEASURE       4
#define STATE_OK_PUBLISH       5
#define STATE_INIT             6
#define STATE_STANDBY          7
#define STATE_CRITICAL         8
int current_state;
int last_state_change;

// Binary sensors variables for control them within interrupts
volatile int last_pir_trigered = 0;
volatile int last_vibro_trigered = 0;
volatile int last_light_trigered = 0;

volatile bool pir_state = LOW;
volatile bool vibro_state = LOW;
volatile bool light_state = LOW;
bool last_light_post_state = LOW;

volatile bool flag_publish_pir = LOW;
volatile bool flag_publish_vibro = LOW;
volatile bool flag_publish_light = LOW;

//**********************************
//** SETUP
//**********************************
void setup()
{
  uint8_t MAC_array[6];

  Serial.begin(9600);
  setup_timers();
  setup_leds();
  set_state(STATE_INIT);
  connectWiFi();

  //Get the mac and convert it to a string.
  WiFi.macAddress(MAC_array);
  for (int i = 0; i < sizeof(MAC_array); ++i)
  {
    sprintf(MAC_char, "%s%02x", MAC_char, MAC_array[i]);
  }

#ifdef DHTPIN
  setup_dht_sensor();
#endif

#ifdef ONE_WIRE_BUS
  setup_dallas_sensors();
#endif

// I2c sensors
#ifdef PIN_I2C_SDA
  Wire.begin();
#endif
#ifdef WITH_BME280
  setup_bme280_sensor();
#endif
#ifdef WITH_HTU21
  setup_htu21_sensor();
#endif
#ifdef WITH_BH1750
  setup_bh1750_light_sensor();
#endif

  setup_boolean_sensors();

  if (VERBOSE) {
    Serial.print("MAC ADRESS: ");
    Serial.println(MAC_char);
  }
  set_state(STATE_CRITICAL);
}

//**********************************
//** LOOP
//**********************************
void loop()
{
  bool sensor_ok = false;
  bool sensed_data = false;
  bool bin_publish = false;
  bool sensor_publish = false;
  int mqtt_retries = 0;

  //Reconnect if disconnected.
  if (WiFi.status() != WL_CONNECTED)
  {
    set_state(STATE_CRITICAL);
    connectWiFi();
  }

  //Check the MQTT connection and process it
  if (!client.connected())
  {
    while (!client.connected())
    {
      if (!client.connect((MQTT_USERID + String(MAC_char)).c_str(), MQTT_USER, MQTT_PASSWORD,
                          (MQTT_WILLTOPIC + String(MAC_char)).c_str(), MQTT_WILLQOS,
                          MQTT_WILLRETAIN, MQTT_STATE_OFF))
      {
        set_state(STATE_ERROR);
        if (VERBOSE)
        {
          Serial.print(i_text_state_pubsubclient(client.state()));
          Serial.print("MQTT retry # ");
          Serial.println(mqtt_retries);
        }
        delay(DELAY_MS_BETWEEN_RETRIES);
      }
      mqtt_retries += 1;
    }
    client.subscribe((mqtt_control_topic + String(MAC_char) + mqtt_switch_bin_sensors_subtopic + mqtt_subtopic_set).c_str());
    client.subscribe((mqtt_control_topic + String(MAC_char) + mqtt_switch_leds_subtopic + mqtt_subtopic_set).c_str());
    client.subscribe((MQTT_WILLTOPIC + String(MAC_char)).c_str());
    publish_switch_states();
  }
  client.loop();

  turn_off_motion_sensors_after_delay();
  bin_publish = publish_binary_sensors_if_flag_or_delta();
#ifdef DHTPIN
  sample_dht22_sensor_data(&sensed_data, &sensor_ok);
#endif
#ifdef ONE_WIRE_BUS
  sample_ds18b20_sensor_data(&sensed_data, &sensor_ok);
#endif
#ifdef WITH_BME280
  sample_bme280_sensor_data(&sensed_data, &sensor_ok);
#endif
#ifdef WITH_HTU21
  sample_htu21_sensor_data(&sensed_data, &sensor_ok);
#endif
#ifdef WITH_BH1750
  sample_bh1750_sensor_data(&sensed_data, &sensor_ok);
#endif

  sensor_publish = publish_analog_light_at_delta();
  sensor_publish = publish_dht22_sensor_data() || sensor_publish;
  sensor_publish = publish_bme280_sensor_data() || sensor_publish;
  sensor_publish = publish_htu21_sensor_data() || sensor_publish;
  sensor_publish = publish_bh1750_sensor_data() || sensor_publish;

//  if (publish_analog_light_at_delta() || publish_dht22_sensor_data() || publish_bme280_sensor_data() || publish_ds18b20_sensor_data())
  if (sensor_publish)
  {
    set_state(STATE_OK_PUBLISH);
  }
  else if (sensed_data && sensor_ok)
  {
    set_state(STATE_OK_MEASURE);
  }
  else if (sensed_data)
  {
    set_state(STATE_WARN);
  }
  else if (bin_publish)
  {
    set_state(STATE_BIN_PUBLISH);
  }
  else
  {
    auto_standby();
  }
}

//**********************************
//** METHODS
//**********************************
const char *i_text_state_pubsubclient(int state)
{
  //Returns the current state of the client. If a connection attempt fails, this can be used to get more information about the failure.
  switch (state)
  {
    case -4:
      return "MQTT_CONNECTION_TIMEOUT - the server did not respond within the keepalive time";
    case -3:
      return "MQTT_CONNECTION_LOST - the network connection was broken";
    case -2:
      return "MQTT_CONNECT_FAILED - the network connection failed";
    case -1:
      return "MQTT_DISCONNECTED - the client is disconnected cleanly";
    case 0:
      return "MQTT_CONNECTED - the cient is connected";
    case 1:
      return "MQTT_CONNECT_BAD_PROTOCOL - the server does not support the requested version of MQTT";
    case 2:
      return "MQTT_CONNECT_BAD_CLIENT_ID - the server rejected the client identifier";
    case 3:
      return "MQTT_CONNECT_UNAVAILABLE - the server was unable to accept the connection";
    case 4:
      return "MQTT_CONNECT_BAD_CREDENTIALS - the username/password were rejected";
    case 5:
      return "MQTT_CONNECT_UNAUTHORIZED - the client was not authorized to connect";
  }
  return "MQTT_STATE ????";
}

void auto_standby()
{
  if ((sinceStart - last_state_change > PERSISTENT_STATE_MS_UNTIL_STANDBY)
      && current_state != STATE_STANDBY && !i_state_critical())
  {
    set_state(STATE_STANDBY);
  }
}

void turn_off_motion_sensors_after_delay()
{
#ifdef PIN_PIR
  // PIR binary sensor to off after a delay:
  if (pir_state && (sinceStart - last_pir_trigered > DELTA_MS_TO_TURN_OFF_MOVS))
  {
    pir_state = LOW;
    flag_publish_pir = HIGH;
  }
#endif

#ifdef PIN_VIBRO
  // Vibration binary sensor to off after a delay:
  if (vibro_state && (sinceStart - last_vibro_trigered > DELTA_MS_TO_TURN_OFF_VIBRO))
  {
    vibro_state = LOW;
    flag_publish_vibro = HIGH;
  }
#endif
}

