azogue/hass_config/esp8266_sensors/mqtt_pir_vibro_light_dht22_publisher.c
void set_color_rgb(uint16_t red, uint16_t green, uint16_t blue)
{
#ifdef LED_RGB_RED
#ifdef USE_ESP32
  // hueToRGB(color, brightness);  // call function to convert hue to RGB
  // write the RGB values to the pins
  ledcWrite(1, (uint32_t)(red / 4)); // write red component to channel 1, etc.
  ledcWrite(2, (uint32_t)(green / 4));
  ledcWrite(3, (uint32_t)(blue / 4));
#else
  analogWrite(LED_RGB_RED, red);
  analogWrite(LED_RGB_GREEN, green);
  analogWrite(LED_RGB_BLUE, blue);
#endif
#endif
}

bool i_state_critical()
{
  switch (current_state)
  {
    case STATE_INIT:
    case STATE_OK_MEASURE:
    case STATE_OK_PUBLISH:
    case STATE_BIN_PUBLISH:
    case STATE_STANDBY:
      {
        return false;
      }
    //    case STATE_WEBACCESS:
    case STATE_ERROR:
    case STATE_WARN:
    case STATE_CRITICAL:
      {
        return true;
      }
  }
}

void set_state(int new_state)
{
  bool state_changed = current_state != new_state;
  current_state = new_state;
  last_state_change = sinceStart;

  // Set RGB LED state:
  if (use_leds)
  {
    switch (current_state)
    {
      case STATE_INIT:
        {
          set_color_rgb(1023, 1023, 1023);
          break;
        }
      case STATE_ERROR:
        {
          if (VERBOSE && state_changed)
            Serial.println("ERROR STATE (red)");
          set_color_rgb(1023, 0, 0);
          break;
        }
      case STATE_WARN:
        {
          if (VERBOSE && state_changed)
            Serial.println("WARNING STATE (R+.5G)");
          set_color_rgb(1023, 512, 0);
          break;
        }
      case STATE_CRITICAL:
        {
          if (VERBOSE && state_changed)
            Serial.println("CRITICAL STATE (violet)");
          set_color_rgb(1023, 0, 1023);
          break;
        }
      case STATE_OK_MEASURE:
        {
          set_color_rgb(0, 0, 1023);
          break;
        }
      case STATE_OK_PUBLISH:
        {
          //      Serial.println("OK PUBLISH");
          set_color_rgb(0, 1023, 0);
          break;
        }
      case STATE_BIN_PUBLISH:
        {
          //      Serial.println("OK PUBLISH");
          set_color_rgb(0, 255, 512);
          break;
        }
      case STATE_STANDBY:
        {
          set_color_rgb(0, 0, 0);
          break;
        }
    }
  }
  else
  {
    set_color_rgb(0, 0, 0);
  }
}

void isr_pir_change()
{
  if (use_binary_sensors && !pir_state && (sinceStart - last_pir_trigered > DELAY_MIN_MS_ENTRE_MOVS))
  {
    pir_state = HIGH;
    flag_publish_pir = HIGH;
  }
  last_pir_trigered = sinceStart;
}

void isr_vibro_change()
{
  if (use_binary_sensors && !vibro_state && (sinceStart - last_vibro_trigered > DELAY_MIN_MS_ENTRE_VIBRO_SENSOR))
  {
    vibro_state = HIGH;
    flag_publish_vibro = HIGH;
  }
  last_vibro_trigered = sinceStart;
}

#ifdef PIN_LIGHT_SENSOR_DIGITAL
void isr_light_sensor_change()
{
  if (use_binary_sensors && sinceStart - last_light_trigered > DELAY_MIN_MS_ENTRE_LIGHT_SENSOR)
  {
    bool new_light_state = digitalRead(PIN_LIGHT_SENSOR_DIGITAL);
    if (new_light_state != light_state)
    {
      light_state = !light_state;
      flag_publish_light = HIGH;
    }
  }
  last_light_trigered = sinceStart;
}
#endif

#ifdef PIN_LIGHT_SENSOR_ANALOG
float read_analog_light_percentage()
{
#ifdef NEGATE_SENSOR_ANALOG
  return round(100. * analogRead(PIN_LIGHT_SENSOR_ANALOG) /  10.23) / 100.;
#else
  return round(100. * (1023 - analogRead(PIN_LIGHT_SENSOR_ANALOG)) /  10.23) / 100.;
#endif
}
#endif

void sample_dht22_sensor_data(bool *sampled, bool *sample_ok)
{
  *sampled = false;
  *sample_ok = false;

#ifdef DHTPIN
  // Collect the DHT22 sensor data
  if (sinceStart - last_dht_sensed > RESULTS_SAMPLE_RATE * 1000)
  {
    double temp = -999;
    double humid = -999;
    sensors_event_t event;

    *sampled = true;
    //Collect the temperature from a sensor.
    dht.temperature().getEvent(&event);
    if (!isnan(event.temperature))
    {
      temp = event.temperature;
      if (VERBOSE) {
        Serial.print("Temp: ");
        Serial.print(temp);
        Serial.print(" ^C, ");
      }
    }
    // Get humidity event and print its value.
    dht.humidity().getEvent(&event);
    if (!isnan(event.relative_humidity))
    {
      humid = event.relative_humidity;
      if (VERBOSE) {
        Serial.print("Humidity: ");
        Serial.print(humid);
        Serial.println(" %");
      }
    }

    if ((temp == -999) || (humid == -999))
    {
      sensor_t sensor;
      if (VERBOSE) {
        Serial.print("DHT ERROR # ");
        Serial.print(error_counter_dht);
        Serial.print(": ");
        Serial.print(temp);
        Serial.print(" / ");
        Serial.println(humid);
      }
      dht.begin();
      dht.temperature().getSensor(&sensor);
      last_sensor_error = sinceStart;
      error_counter_dht += 1;
      *sample_ok = false;

      if (error_counter_dht > NUM_MAX_ERRORS_DHT)
        reset_exec();
    }
    else
    {
      last_sensor_ok = sinceStart;
      *sample_ok = true;
      error_counter_dht = 0;

      //Make sure a valid temperature was sampled
      if (temp != -999)
        tempSamples.push_front(temp);

      if (humid != -999)
        humidSamples.push_front(humid);
    }

    last_dht_sensed = sinceStart;
  }
#endif
}

void sample_bme280_sensor_data(bool *sampled, bool *sample_ok)
{
  *sampled = false;
  *sample_ok = false;

#ifdef WITH_BME280
  // Collect the sensor data
  if (sinceStart - last_bme_sensed > RESULTS_SAMPLE_RATE * 1000)
  {
    double temp, humid, pressure;

    *sampled = true;
    *sample_ok = true;

    bme.takeForcedMeasurement();

    temp = bme.readTemperature();
    humid = bme.readHumidity();
    pressure = bme.readPressure() / 100.0F;

    if (VERBOSE) {
      Serial.print("Temp: ");
      Serial.print(temp);
      Serial.print(" ^C, ");
      Serial.print("Humidity: ");
      Serial.print(humid);
      Serial.print(" %, ");
      Serial.print("Pressure: ");
      Serial.print(pressure);
      Serial.println(" mbar");
    }
    if (temp)
    {
      temp += DELTA_TEMP_BME280;
      bme_tempSamples.push_front(temp);
    }
    if (humid)
      bme_humidSamples.push_front(humid);
    if (pressure)
      bme_pressureSamples.push_front(pressure);
    if (!temp | !humid | !pressure)
      *sample_ok = false;
    last_bme_sensed = sinceStart;
  }
#endif
}

void sample_bh1750_sensor_data(bool *sampled, bool *sample_ok)
{
  *sampled = false;
  *sample_ok = false;

#ifdef WITH_BH1750
  // Collect the sensor data
  if (sinceStart - last_bh1750_sensed > RESULTS_SAMPLE_RATE * 1000)
  {
    uint16_t light_level = bh1750_light_sensor.readLightLevel();

    if (VERBOSE) {
      Serial.print("Light: ");
      Serial.print(light_level);
      Serial.println(" lux");
    }
    if (light_level)
    {
      *sampled = true;
      *sample_ok = true;
      bh1750_lightSamples.push_front((double)light_level);
      last_bh1750_sensed = sinceStart;
    }
  }
#endif
}

void sample_htu21_sensor_data(bool *sampled, bool *sample_ok)
{
  *sampled = false;
  *sample_ok = false;

#ifdef WITH_HTU21
  // Collect the sensor data
  if (sinceStart - last_htu21_sensed > RESULTS_SAMPLE_RATE * 1000)
  {
    float humd = htu21_sensor.readHumidity();
    float temp = htu21_sensor.readTemperature();

    if (humd > 0 & humd <= 100. & temp > -25.)
    {
      *sampled = true;
      *sample_ok = true;
      if (VERBOSE) {
        Serial.print("Temp: ");
        Serial.print(temp);
        Serial.print(" ^C, ");
        Serial.print("Humidity: ");
        Serial.print(humd);
        Serial.println(" %");
      }
      htu21_tempSamples.push_front((double)temp);
      htu21_humidSamples.push_front((double)humd);
      last_htu21_sensed = sinceStart;
    }
  }
#endif
}

#ifdef ONE_WIRE_BUS
bool i_push_front_ds18b20_temp(uint8_t index, DeviceAddress address,
                               std::list<double> *temp_samples)
{
  float temp;

  temp = DS18B20.getTempC(address);
  //temp = DS18B20.getTempCByIndex(index);
  if (temp > -20 & temp < 75)
  {
    temp_samples->push_front(temp);
    if (VERBOSE) {
      Serial.print("DS18b20-");
      Serial.print(index + 1);
      Serial.print(" - Temperature: ");
      Serial.print(temp);
      Serial.println(" ^C");
    }
    return true;
  }
  return false;
}
#endif

void sample_ds18b20_sensor_data(bool *sampled, bool *sample_ok)
{
  *sampled = false;
  *sample_ok = false;

#ifdef ONE_WIRE_BUS
  // Collect the sensor data
  if (sinceStart - last_ds18b20_sensed > RESULTS_SAMPLE_RATE * 1000)
  {
    double temp = -127.;

    while (temp == 85.0 || temp == -127.0) {
      DS18B20.requestTemperatures();
      temp = DS18B20.getTempCByIndex(0);

//      TODO comparador con última muestra (para eliminar 'outlets')
      if (VERBOSE && (temp > 60.0 || temp < -15.0)) {
        Serial.print("Bad temperature reading: ");
        Serial.print(temp);
        Serial.println(" ^C");
      }
    }
    *sampled = true;

    if (temp)
    {
      *sample_ok = true;
      for (uint8_t i = 0; i < NUM_SENSORS_DS18B20; i++)
      {
        uint8_t address[8];
        for (uint8_t j=0; j<8; j++)
          address[j] = ds18b20Probes[i*8+j];
        if (!i_push_front_ds18b20_temp(i, address, &ds18b20_tempSamples_arr[i]))
          if (VERBOSE) {
            Serial.print("BAD READING DS18b20-");
            Serial.println(i + 1);
          }
      }
      last_ds18b20_sensed = sinceStart;
    }
  }
#endif
}

void calc_sensor_stats(std::list<double> *samples, std::list<double> *history)
{
  int count = 0;
  double samples_sum = 0;
  double samples_average;

  if (samples->size() > 0)
  {
    for (std::list<double>::iterator sensiter = samples->begin(); sensiter != samples->end(); sensiter++)
    {
      count++;
      samples_sum += *sensiter;
    }
    samples_average = samples_sum / count;

    //Add the new data to the history.
    history->push_front(samples_average);
    if (history->size() > SENSOR_HISTORY_RECORDS)
    {
      history->pop_back();
    }
  }
  samples->clear();
}

//**********************************
//** Setup methods
//**********************************
void setup_timers()
{
  sinceStart = 0;
  last_state_change = 0;
  last_sensor_error = 0;
  last_sensor_ok = 0;
  last_dht_sensed = 0;                //The last time a sample was taken from the DHT22 sensor.
  last_ds18b20_sensed = 0;
  last_bme_sensed = 0;
  last_bh1750_sensed = 0;
  last_htu21_sensed = 0;
  error_counter_dht = 1;

  // Init values to wait some time before the 1st publish.
  last_temp_post = 15000;
  last_temp_ds_post = 10000;
  last_humid_post = 15000;
  last_pressure_post = 15000;
  last_light_analog_post = 10000;
  last_switch_bin_state_post = 0;
  last_switch_leds_state_post = 0;
}

void setup_leds()
{
#ifdef LED_PIR
  pinMode(LED_PIR, OUTPUT);
#endif
#ifdef LED_VIBRO
  pinMode(LED_VIBRO, OUTPUT);
#endif

#ifdef LED_RGB_RED
#ifdef USE_ESP32
  ledcAttachPin(LED_RGB_RED, 1); // assign RGB led pins to channels
  ledcAttachPin(LED_RGB_GREEN, 2);
  ledcAttachPin(LED_RGB_BLUE, 3);
  // Initialize channels
  // channels 0-15, resolution 1-16 bits, freq limits depend on resolution
  // ledcSetup(uint8_t channel, uint32_t freq, uint8_t resolution_bits);
  ledcSetup(1, 12000, 8); // 12 kHz PWM, 8-bit resolution
  ledcSetup(2, 12000, 8);
  ledcSetup(3, 12000, 8);
#else
  pinMode(LED_RGB_RED, OUTPUT);
  pinMode(LED_RGB_GREEN, OUTPUT);
  pinMode(LED_RGB_BLUE, OUTPUT);
#endif
#endif
}

#ifdef DHTPIN
void setup_dht_sensor()
{
  dht.begin();
  sensor_t sensor;
  dht.temperature().getSensor(&sensor);
  if (VERBOSE) {
    Serial.println("------------------------------------");
    Serial.println("Temperature");
    Serial.print  ("Sensor:       "); Serial.println(sensor.name);
    Serial.print  ("Driver Ver:   "); Serial.println(sensor.version);
    Serial.print  ("Unique ID:    "); Serial.println(sensor.sensor_id);
    Serial.print  ("Max Value:    "); Serial.print(sensor.max_value); Serial.println(" *C");
    Serial.print  ("Min Value:    "); Serial.print(sensor.min_value); Serial.println(" *C");
    Serial.print  ("Resolution:   "); Serial.print(sensor.resolution); Serial.println(" *C");
    Serial.println("------------------------------------");
  }
  dht.humidity().getSensor(&sensor);
  // Print humidity sensor details.
  dht.humidity().getSensor(&sensor);
  if (VERBOSE) {
    Serial.println("------------------------------------");
    Serial.println("Humidity");
    Serial.print  ("Sensor:       "); Serial.println(sensor.name);
    Serial.print  ("Driver Ver:   "); Serial.println(sensor.version);
    Serial.print  ("Unique ID:    "); Serial.println(sensor.sensor_id);
    Serial.print  ("Max Value:    "); Serial.print(sensor.max_value); Serial.println("%");
    Serial.print  ("Min Value:    "); Serial.print(sensor.min_value); Serial.println("%");
    Serial.print  ("Resolution:   "); Serial.print(sensor.resolution); Serial.println("%");
    Serial.println("------------------------------------");
  }
}
#endif

