azogue/hass_config/esp8266_sensors/mqtt_pir_vibro_light_dht22_publisher.c
#ifdef WITH_BME280
void setup_bme280_sensor()
{
  bool bme_status;

  // default settings
  bme_status = bme.begin();
  if (!bme_status)
  {
    if (VERBOSE)
      Serial.println("Could not find a valid BME280 sensor, check wiring!");
    set_state(STATE_CRITICAL);
    delay(10000);
    reset_exec();
  }
  /* bme.setSampling(sensor_mode mode  = MODE_NORMAL,
         sensor_sampling tempSampling  = SAMPLING_X16,
         sensor_sampling pressSampling = SAMPLING_X16,
         sensor_sampling humSampling   = SAMPLING_X16,
         sensor_filter filter          = FILTER_OFF,
         standby_duration duration     = STANDBY_MS_0_5
  ); */
  //bme.setSampling(Adafruit_BME280::MODE_NORMAL, Adafruit_BME280::SAMPLING_X2, Adafruit_BME280::SAMPLING_X2, Adafruit_BME280::SAMPLING_X2, Adafruit_BME280::FILTER_OFF, Adafruit_BME280::STANDBY_MS_1000);
  bme.setSampling(Adafruit_BME280::MODE_FORCED, Adafruit_BME280::SAMPLING_X1, Adafruit_BME280::SAMPLING_X1, Adafruit_BME280::SAMPLING_X1, Adafruit_BME280::FILTER_OFF, Adafruit_BME280::STANDBY_MS_1000);

  delay(100); // let sensor boot up
}
#endif

#ifdef WITH_BH1750
void setup_bh1750_light_sensor()
{
  //bh1750_light_sensor.begin(BH1750_CONTINUOUS_HIGH_RES_MODE);

  //bh1750_light_sensor.configure(BH1750_ONE_TIME_HIGH_RES_MODE);
  //bh1750_light_sensor.configure(BH1750_ONE_TIME_HIGH_RES_MODE_2);

  // OK:
  //bh1750_light_sensor.configure(BH1750_CONTINUOUS_HIGH_RES_MODE);
  bh1750_light_sensor.configure(BH1750_CONTINUOUS_HIGH_RES_MODE_2);
}
#endif

#ifdef WITH_HTU21
void setup_htu21_sensor()
{
  htu21_sensor.begin();
}
#endif

#ifdef ONE_WIRE_BUS
void discoverOneWireDevices(void)
{
  byte i;
  byte present = 0;
  byte data[12];
  byte addr[8];

  Serial.print("Looking for 1-Wire devices...\n\r");// "\n\r" is NewLine
  while(oneWire.search(addr)) {
    Serial.print("\n\r\n\rFound \'1-Wire\' device with address:\n\r");
    for( i = 0; i < 8; i++) {
      Serial.print("0x");
      if (addr[i] < 16) {
        Serial.print('0');
      }
      Serial.print(addr[i], HEX);
      if (i < 7) {
        Serial.print(", ");
      }
    }
    if ( OneWire::crc8( addr, 7) != addr[7]) {
      Serial.print("CRC is not valid!\n\r");
      return;
    }
  }
  Serial.println();
  Serial.print("Done");
  oneWire.reset_search();
  return;

//  TODO control de sondas conectadas vs sondas definidas
}

void setup_dallas_sensors()
{
  uint8_t i, num_dallas_sensors;
  boolean ok_address, is_connected;

  discoverOneWireDevices();

  DS18B20.begin();
  delay(200); // let sensor boot up
  for (i = 0; i < NUM_SENSORS_DS18B20; i++)
  {
    delay(200); // let sensor boot up
    uint8_t address;
    ok_address = DS18B20.getAddress(&address, i);
    is_connected = DS18B20.isConnected(&address);
    if (VERBOSE)
    {
      Serial.print("* DS18b20 Sensor ");
      Serial.print(i);
      Serial.print(" -> ok_address: ");
      Serial.print(ok_address);
      Serial.print(" -> conected: ");
      Serial.print(is_connected);
      Serial.print(", address: ");
//      Serial.println(String(address));
      Serial.println(address, HEX);
//      Serial.println(String((char*)address));
    }
  }
  delay(200); // let sensor boot up
  num_dallas_sensors = DS18B20.getDeviceCount();
  if (VERBOSE)
  {
    Serial.print("DS18b20 Sensors found: ");
    Serial.println(num_dallas_sensors);
  }
}
#endif

void setup_boolean_sensors()
{
#ifdef PIN_PIR
  pinMode(PIN_PIR, INPUT);
  attachInterrupt(digitalPinToInterrupt(PIN_PIR), isr_pir_change, CHANGE);
#endif

#ifdef PIN_VIBRO
  pinMode(PIN_VIBRO, INPUT);
  attachInterrupt(digitalPinToInterrupt(PIN_VIBRO), isr_vibro_change, CHANGE);
#endif

#ifdef PIN_LIGHT_SENSOR_DIGITAL
  pinMode(PIN_LIGHT_SENSOR_DIGITAL, INPUT);
  attachInterrupt(digitalPinToInterrupt(PIN_LIGHT_SENSOR_DIGITAL), isr_light_sensor_change, CHANGE);
#endif

#ifdef PIN_LIGHT_SENSOR_ANALOG
  pinMode(PIN_LIGHT_SENSOR_ANALOG, INPUT);
#endif
}

void connectWiFi()
{
  elapsedMillis wifi_try = 0;
//#ifdef USE_ESP32
  //char *pass = (char*) malloc(strlen(WiFiPSK));
  //strcpy(pass, WiFiPSK);
//  WiFi.begin((char *)WiFiSSID, (const char *)WiFiPSK);
//#else
  WiFi.mode(WIFI_STA);
  WiFi.begin(WiFiSSID, WiFiPSK);
//#endif

  if (VERBOSE) {
    Serial.print("Attempting to connect to WPA SSID: ");
    Serial.print(WiFiSSID);
  }

  set_state(STATE_CRITICAL);
  while (WiFi.status() != WL_CONNECTED)
  {
    if (VERBOSE)
      Serial.print (".");
    //Delay until connected.
    delay(DELAY_MS_BETWEEN_RETRIES);
    if (wifi_try > 60000)
      reset_exec();
  }
  if (VERBOSE) {
    Serial.println("You are connected to the network");
    printWifiStatus();
  }
  set_state(STATE_STANDBY);
}

void printWifiStatus()
{
  // print the SSID of the network you're attached to
  Serial.print("SSID: ");
  Serial.println(WiFi.SSID());

  // print your WiFi shield's IP address
  IPAddress ip = WiFi.localIP();
  Serial.print("IP Address: ");
  Serial.println(ip);

#ifndef USE_ESP32
  // print the received signal strength
  long rssi = WiFi.RSSI();
  Serial.print("Signal strength (RSSI):");
  Serial.print(rssi);
  Serial.println(" dBm");
#endif
}

void reset_exec()
{
  if (VERBOSE)
    Serial.println("ABORTING ...");
  set_color_rgb(1023, 200, 200);
  delay(30000);
  ESP.restart();
}

//**********************************
//** MQTT
//**********************************
void publish_switch_states()
{
  if (!in_default_state_binary_sensors && (sinceStart - last_switch_bin_state_post > DELAY_MS_BETWEEN_MQTT_PUB_STATE))
  {
    if (client.publish((mqtt_control_topic + String(MAC_char) + mqtt_switch_bin_sensors_subtopic).c_str(),
                       use_binary_sensors ? MQTT_STATE_ON : MQTT_STATE_OFF, HIGH))
    {
      last_switch_bin_state_post = sinceStart;
    }
  }
  if (!in_default_state_use_leds && (sinceStart - last_switch_leds_state_post > DELAY_MS_BETWEEN_MQTT_PUB_STATE))
  {
    if (client.publish((mqtt_control_topic + String(MAC_char) + mqtt_switch_leds_subtopic).c_str(),
                       use_leds ? MQTT_STATE_ON : MQTT_STATE_OFF, HIGH))
    {
      last_switch_leds_state_post = sinceStart;
    }
  }
}

