azogue/hass_config/esp8266_sensors/mqtt_pir_vibro_light_dht22_publisher.c
bool publish_binary_sensors_if_flag_or_delta()
{
  bool any_publish = false;
#ifdef PIN_PIR
  // Update PIR state:
  if (flag_publish_pir)
  {
#ifdef LED_PIR
    if (use_leds)
      digitalWrite(LED_PIR, pir_state);
#endif
    flag_publish_pir = !publish_mqtt_binary_sensor("MOVEMENT", "MOVEMENT OFF", pir_state, mqtt_movement_topic);
    any_publish = !flag_publish_pir;
  }
#endif

#ifdef PIN_VIBRO
  // Update vibro sensor state:
  if (flag_publish_vibro)
  {
#ifdef LED_VIBRO
    if (use_leds)
      digitalWrite(LED_VIBRO, vibro_state);
#endif
    flag_publish_vibro = !publish_mqtt_binary_sensor("VIBRATION", "VIBRATION OFF", vibro_state, mqtt_vibro_topic);
    any_publish = !flag_publish_vibro || any_publish;
  }
#endif

#ifdef PIN_LIGHT_SENSOR_DIGITAL
  // Update LIGHT state:
  if (flag_publish_light || (sinceStart - last_light_analog_post > MQTT_POSTINTERVAL_LIGHT_SEC * 1000))
  {
    if (!flag_publish_light)
    {
      light_state = digitalRead(PIN_LIGHT_SENSOR_DIGITAL);
      if (light_state != last_light_post_state)
      {
        last_light_post_state = light_state;
        flag_publish_light = !publish_mqtt_binary_sensor("LIGHT", "LIGHT OFF", !light_state, mqtt_light_topic);
        any_publish = !flag_publish_light || any_publish;
      }
    }
    else
    {
      last_light_post_state = light_state;
      flag_publish_light = !publish_mqtt_binary_sensor("LIGHT", "LIGHT OFF", !light_state, mqtt_light_topic);
      any_publish = !flag_publish_light || any_publish;
    }
  }
#endif

  return any_publish;
}

bool publish_analog_light_at_delta()
{
#ifdef PIN_LIGHT_SENSOR_ANALOG
  if (sinceStart - last_light_analog_post > MQTT_POSTINTERVAL_LIGHT_SEC * 1000)
  {
    if (publish_mqtt_data("LIGHT AO", mqtt_light_analog_topic, String(read_analog_light_percentage()).c_str(), false))
    {
      last_light_analog_post = sinceStart;
      return true;
    }
  }
#endif
  return false;
}

bool publish_dht22_sensor_data()
{
  bool publishing_t = false, publishing_h = false;

#ifdef DHTPIN
  //post MQTT DHT22 data every X seconds
  if ((error_counter_dht == 0) && (sinceStart - last_temp_post > MQTT_POSTINTERVAL_DHT22_SEC * 1000))
  {
    calc_sensor_stats(&tempSamples, &tempHistory);
    if (tempHistory.size() > 0)
    {
      publishing_t = publish_mqtt_data("TEMP", mqtt_temp_topic,
                                       String(tempHistory.front()).c_str(), false);
      if (publishing_t)
        last_temp_post = sinceStart;
    }
  }

  if ((error_counter_dht == 0) && (sinceStart - last_humid_post > MQTT_POSTINTERVAL_DHT22_SEC * 1000))
  {
    calc_sensor_stats(&humidSamples, &humidHistory);
    if (humidHistory.size() > 0)
    {
      publishing_h = publish_mqtt_data("HUMID", mqtt_humid_topic,
                                       String(humidHistory.front()).c_str(), false);
      if (publishing_h)
        last_humid_post = sinceStart;
    }
  }
#endif

  //    return publishing_t && publishing_h;
  return publishing_t || publishing_h;
}

bool publish_bme280_sensor_data()
{
  bool publishing_t = false, publishing_h = false, publishing_p = false;
#ifdef WITH_BME280
  //post MQTT BME280 data every X seconds
  if (sinceStart - last_temp_post > MQTT_POSTINTERVAL_BME280_SEC * 1000)
  {
    calc_sensor_stats(&bme_tempSamples, &bme_tempHistory);
    if (bme_tempHistory.size() > 0)
      publishing_t = publish_mqtt_data("TEMP", mqtt_temp_topic,
                                       String(bme_tempHistory.front()).c_str(), false);
    if (publishing_t)
      last_temp_post = sinceStart;
  }

  if (sinceStart - last_humid_post > MQTT_POSTINTERVAL_BME280_SEC * 1000)
  {
    calc_sensor_stats(&bme_humidSamples, &bme_humidHistory);
    if (bme_humidHistory.size() > 0)
      publishing_h = publish_mqtt_data("HUMID", mqtt_humid_topic,
                                       String(bme_humidHistory.front()).c_str(), false);
    if (publishing_h)
      last_humid_post = sinceStart;
  }

  if (sinceStart - last_pressure_post > MQTT_POSTINTERVAL_BME280_SEC * 1000)
  {
    calc_sensor_stats(&bme_pressureSamples, &bme_pressureHistory);
    if (bme_pressureHistory.size() > 0)
      publishing_p = publish_mqtt_data("PRESSURE", mqtt_pressure_topic,
                                       String(bme_pressureHistory.front()).c_str(), false);
    if (publishing_p)
      last_pressure_post = sinceStart;
  }
#endif
  return publishing_t || publishing_h || publishing_p;
}

bool publish_htu21_sensor_data()
{
  bool publishing_t = false, publishing_h = false;
#ifdef WITH_HTU21
  //post MQTT data every X seconds
  if (sinceStart - last_temp_post > MQTT_POSTINTERVAL_HTV21_SEC * 1000)
  {
    calc_sensor_stats(&htu21_tempSamples, &htu21_tempHistory);
    if (htu21_tempHistory.size() > 0)
      publishing_t = publish_mqtt_data("TEMP", mqtt_temp_topic,
                                       String(htu21_tempHistory.front()).c_str(), false);
    if (publishing_t)
      last_temp_post = sinceStart;
  }

  if (sinceStart - last_humid_post > MQTT_POSTINTERVAL_HTV21_SEC * 1000)
  {
    calc_sensor_stats(&htu21_humidSamples, &htu21_humidHistory);
    if (htu21_humidHistory.size() > 0)
      publishing_h = publish_mqtt_data("HUMID", mqtt_humid_topic,
                                       String(htu21_humidHistory.front()).c_str(), false);
    if (publishing_h)
      last_humid_post = sinceStart;
  }
#endif
  return publishing_t || publishing_h;
}

bool publish_bh1750_sensor_data()
{
  bool publishing = false;
#ifdef WITH_BH1750
  //post MQTT BME280 data every X seconds
  if (sinceStart - last_light_analog_post > MQTT_POSTINTERVAL_BH1750_SEC * 1000)
  {
    calc_sensor_stats(&bh1750_lightSamples, &bh1750_lightHistory);
    if (bh1750_lightHistory.size() > 0)
      publishing = publish_mqtt_data("LIGHT_LUX", mqtt_light_lux_topic,
                                       String(bh1750_lightHistory.front()).c_str(), false);
    if (publishing)
      last_light_analog_post = sinceStart;
  }
#endif
  return publishing;
}

bool publish_ds18b20_sensor_data()
{
  bool publishing_1 = false, publishing_2 = false, publishing_3 = false, publishing_4 = false, publishing_5 = false;
  bool publishing = false;

#ifdef ONE_WIRE_BUS
  //post MQTT DS18b20 data every X seconds
  if (sinceStart - last_temp_ds_post > MQTT_POSTINTERVAL_DS18B20_SEC * 1000)
  {
    for (uint8_t i = 0; i < NUM_SENSORS_DS18B20; i++)
    {
      bool publishing_i;
      String topic;

      topic = String(mqtt_temp_ds_topic + String(i + 1) + "_");
      calc_sensor_stats(&ds18b20_tempSamples_arr[i], &ds18b20_tempHistory_arr[i]);
      if (ds18b20_tempHistory_arr[i].size() > 0
          && publish_mqtt_data(String("TEMP_DS_" + String(i)).c_str(), topic.c_str(),
                               String(ds18b20_tempHistory_arr[i].front()).c_str(), false))
          publishing = true;
    }

